cask_args appdir: "~/Applications"

tap "dart-lang/dart", trusted: true
tap "felixkratz/formulae", trusted: true
tap "fluxcd/tap", trusted: true
tap "go-task/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "localstack/tap", trusted: true
tap "nikitabobko/tap", trusted: true
tap "terraform-docs/tap", trusted: true
tap "sass/sass", trusted: true
tap "setchy/brews", trusted: true
tap "nikdoof/tap", trusted: true

# Formulae
brew "awscli"
brew "awslogs"
brew "bat"
brew "bat-extras"
brew "chafa"
brew "composer"
brew "coreutils"
brew "dockutil"
brew "eza"
brew "felixkratz/formulae/borders"
brew "fluxcd/tap/flux"
brew "fzf"
brew "gitleaks"
brew "go"
brew "go-task/tap/go-task"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "helm"
brew "hugo"
brew "jq"
brew "kubeconform"
brew "kubectl-cnpg"
brew "kubelogin"
brew "kubernetes-cli"
brew "kubeseal"
brew "llama.cpp"
brew "llmfit"
brew "localstack/tap/localstack-cli"
brew "mas"
brew "nikdoof/tap/nikdoof-lsq"
brew "nixfmt"
brew "node"
brew "opencode"
brew "opentofu"
brew "php"
brew "poetry"
brew "prek"
brew "prettier"
brew "ripgrep"
brew "sass/sass/sass"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "starship"
brew "terraform-docs"
brew "terraform-local"
brew "tflint"
brew "tlrc"
brew "ty"
brew "tz"
brew "uv"
brew "yazi"
brew "yq"

# Casks
cask "appcleaner"
cask "bettermouse"
cask "claude-code"
cask "clop"
cask "coconutbattery"
cask "daisydisk"
cask "displaylink"
cask "ghostty"
cask "itsycal"
cask "knockknock"
cask "lens"
cask "logseq"
cask "lunar"
cask "nikitabobko/tap/aerospace"
cask "orbstack"
cask "qmk-toolbox"
cask "raycast"
cask "setchy/brews/atlassify"
cask "vial"
cask "viscosity"
cask "vlc"
cask "wireshark-app"
cask "zed"

# Fonts
cask "font-hack-nerd-font"
cask "font-input"
cask "font-inter"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# mas "AmorphousDiskMark", id: 1168254295
# mas "Amphetamine", id: 937984704
# mas "Bitwarden", id: 1352778147
# mas "Discovery", id: 1381004916
# mas "Hand Mirror", id: 1502839586
# mas "Hidden Bar", id: 1452453066
# mas "Home Assistant", id: 1099568401
# mas "Hush", id: 1544743900
# mas "Ivory", id: 6444602274
# mas "MQTT Explorer", id: 1455214828
# mas "OTP Auth", id: 1471867429
# mas "Tailscale", id: 1475387142
# mas "Telegram", id: 747648890
# mas "The Unarchiver", id: 425424353
# mas "Windows App", id: 1295203466
