tap "dart-lang/dart"
tap "fluxcd/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "sass/sass"

brew "go"
brew "hugo"
brew "kubernetes-cli"
brew "kubeseal"
brew "smartmontools"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "sass/sass/sass"

cask "ghostty"
cask "itsycal"
cask "rectangle"

mas "Hush", id: 1544743900
mas "OTP Auth", id: 1471867429
mas "Hidden Bar", id: 1452453066
mas "Amphetamine", id: 937984704
mas "Ivory", id: 6444602274
mas "Telegram", id: 747648890
mas "Tailscale", id: 1475387142
